---
kind: method
id: M:Autodesk.Revit.DB.ElementSet.ReverseIterator
source: html/e82d9ecb-bc55-090e-08d1-baba5b02a392.htm
---
# Autodesk.Revit.DB.ElementSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual ElementSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.